WS-I/BP1.2/Messages/ComplexDataTypes/XmlFormatter/RpcLit/SoapWsdl.ComplexDataTypes.XmlFormatter.RpcLit_RetArrayString1D_Client_Request-4.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IComplexDataTypesRpcLit/RetArrayString1D</a:Action>
    <a:MessageID>urn:uuid:d4fae470-d673-4fa0-8870-6127894c27d4</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetArrayString1D xmlns="http://tempuri.org/">
      <inArrayString1D xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns="">
        <string i:nil="true" xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays" />
        <string xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">string Array Data 1</string>
        <string i:nil="true" xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays" />
        <string xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">string Array Data 3</string>
        <string i:nil="true" xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays" />
        <string xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">string Array Data 5</string>
        <string i:nil="true" xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays" />
        <string xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">string Array Data 7</string>
        <string i:nil="true" xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays" />
        <string xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">string Array Data 9</string>
      </inArrayString1D>
    </RetArrayString1D>
  </s:Body>
</s:Envelope>